artillery/userEndpoints/deleteUser.yaml
config:
    target: http://tukano-1730835561603.azurewebsites.net/tukano/rest
    phases:
        - name: simple_delete
          duration: 1 # how long the test will run for, in seconds
          arrivalRate: 1 # number of arrivals per second.

scenarios:
    - name: TuKanoHome
      flow:
        - delete:
            url: /users/n?pwd=50588044621084659431231249680101104