artillery/userEndpoints/getUser.yaml
config:
    target: http://tukano-1730835561603.azurewebsites.net/tukano/rest
    phases:
        - name: simple_get
          duration: 1 # how long the test will run for, in seconds
          arrivalRate: 1 # number of arrivals per second.

scenarios:
    - name: TuKanoHome
      flow:
        - get:
            url: /users/kgallagher?pwd=easypass